// import { useState } from 'react';
// import './Contact.css'
// import logo from '/image/logo.png'

// export default function Contact() {
//     const [input, setValue] = useState('');

//     const handleInputChange = (event) => {
//         setValue(event.target.value);
//     };
//     return (
//         <div className='lastSection'>
//             <div className="contact">
//                 <div className='about'>
//                     <img src={logo} className='logo' />
//                     <h1 className='title'>درباره چوب لباسی</h1>
//                     <p className='titleDescription'>ماموریت ما در چوب لباسی به عنوان اولین سایت تخصصی کشور در حوزه اجاره پوشاک، این است که فضایی را برای تمام مردم کشور فراهم کنیم که با توجه به نیاز خود،‌بتواند پوشاک مورد نظر خود را با توجه به سلیقه و شخصیت خود انتخاب کند. ما همواره در حال تلاش برای بهتر شدن
//                         و رونق این فضا برای رفاه شما هستیم</p>
//                     <div className='email'>
//                         <p className='nameOfEmail'>ایمیل</p>
//                         <input
//                             type="text"
//                             id="myInput"
//                             value={input}
//                             onChange={handleInputChange}
//                             className='emailSearch'
//                             placeholder='برای اطلاع از آخرین اخبار و تخفیف‌های چوب لباسی ایمیل خود را وارد کنید'
//                         />
//                     </div>
//                 </div>
//                 <div className='contactToUs'>
//                     <div className='SocialMediaitem'>
//                         <svg xmlns="http://www.w3.org/2000/svg" width="210" height="35" viewBox="0 0 210 35" fill="none">
//                             <path d="M120.787 4.72171C121.104 4.68489 121.425 4.73536 121.715 4.86768C122.005 5 122.254 5.20913 122.434 5.47246C125.017 9.25071 128.118 10.8222 131.56 11.1792C131.728 9.70746 132.125 8.25321 132.873 6.97221C133.968 5.09271 135.75 3.71021 138.294 3.19921C141.812 2.49221 144.489 3.76621 146.041 5.32546L149.177 4.73921C149.505 4.67772 149.844 4.71139 150.154 4.83624C150.464 4.9611 150.731 5.17192 150.925 5.44384C151.119 5.71576 151.23 6.03743 151.247 6.37087C151.264 6.70432 151.185 7.03563 151.02 7.32571L148.01 12.6142C148.285 20.246 146.164 25.573 141.642 29.2427C139.244 31.1887 135.811 32.293 132.043 32.6342C128.246 32.9772 123.953 32.5625 119.686 31.3165C119.322 31.2101 119.002 30.9881 118.774 30.6839C118.547 30.3797 118.425 30.0098 118.426 29.6301C118.428 29.2504 118.553 28.8814 118.782 28.5789C119.012 28.2763 119.333 28.0566 119.699 27.953C121.844 27.3422 123.479 26.8155 124.954 25.8932C122.856 24.7802 121.31 23.3242 120.217 21.6652C118.698 19.3587 118.134 16.7862 118.022 14.4675C117.91 12.1487 118.244 9.99971 118.598 8.45096C118.799 7.56721 119.034 6.68171 119.357 5.83471C119.471 5.53614 119.665 5.27456 119.918 5.07835C120.17 4.88214 120.47 4.75879 120.787 4.72171Z" fill="#1F264C" />
//                             <path d="M195.125 34.804C203.544 33.537 210 26.2728 210 17.5C210 7.83475 202.165 0 192.5 0C182.835 0 175 7.83475 175 17.5C175 26.2728 181.456 33.5387 189.875 34.804V22.75H187.25C186.554 22.75 185.886 22.4734 185.394 21.9812C184.902 21.4889 184.625 20.8212 184.625 20.125C184.625 19.4288 184.902 18.7611 185.394 18.2688C185.886 17.7766 186.554 17.5 187.25 17.5H189.875V14C189.875 12.3755 190.52 10.8176 191.669 9.66897C192.818 8.52031 194.376 7.875 196 7.875H196.875C197.571 7.875 198.239 8.15156 198.731 8.64384C199.223 9.13613 199.5 9.80381 199.5 10.5C199.5 11.1962 199.223 11.8639 198.731 12.3562C198.239 12.8484 197.571 13.125 196.875 13.125H196C195.768 13.125 195.545 13.2172 195.381 13.3813C195.217 13.5454 195.125 13.7679 195.125 14V17.5H197.75C198.446 17.5 199.114 17.7766 199.606 18.2688C200.098 18.7611 200.375 19.4288 200.375 20.125C200.375 20.8212 200.098 21.4889 199.606 21.9812C199.114 22.4734 198.446 22.75 197.75 22.75H195.125V34.804Z" fill="#1F264C" />
//                             <path d="M78.299 0C80.2677 0.00524988 81.2669 0.0157496 82.1296 0.0402491L82.4691 0.0524987C82.861 0.0664984 83.2478 0.0839979 83.715 0.104997C85.5769 0.192495 86.8473 0.486489 87.962 0.918729C89.117 1.36322 90.0899 1.9652 91.0629 2.93643C91.9527 3.81123 92.6412 4.86942 93.0805 6.03736C93.5127 7.15208 93.8067 8.42255 93.8942 10.2863C93.9152 10.7517 93.9327 11.1385 93.9467 11.5322L93.9572 11.8717C93.9835 12.7327 93.994 13.7319 93.9975 15.7006L93.9992 17.0061V19.2985C94.0035 20.575 93.9901 21.8514 93.959 23.1275L93.9485 23.467C93.9345 23.8607 93.917 24.2474 93.896 24.7129C93.8085 26.5766 93.511 27.8453 93.0805 28.9618C92.6425 30.1304 91.9538 31.1889 91.0629 32.0628C90.1878 32.9523 89.1298 33.6408 87.962 34.0805C86.8473 34.5127 85.5769 34.8067 83.715 34.8942C83.2998 34.9137 82.8845 34.9312 82.4691 34.9467L82.1296 34.9572C81.2669 34.9817 80.2677 34.9939 78.299 34.9974L76.9936 34.9992H74.703C73.426 35.0036 72.149 34.9902 70.8724 34.9589L70.5329 34.9484C70.1175 34.9327 69.7022 34.9146 69.287 34.8942C67.4251 34.8067 66.1546 34.5127 65.0382 34.0805C63.8704 33.6419 62.8127 32.9532 61.9391 32.0628C61.0485 31.1883 60.3593 30.13 59.9197 28.9618C59.4875 27.8471 59.1935 26.5766 59.106 24.7129C59.0865 24.2977 59.069 23.8824 59.0535 23.467L59.0448 23.1275C59.0125 21.8514 58.9979 20.575 59.001 19.2985V15.7006C58.9961 14.4242 59.009 13.1478 59.0395 11.8717L59.0518 11.5322C59.0658 11.1385 59.0833 10.7517 59.1043 10.2863C59.1917 8.42255 59.4857 7.15383 59.918 6.03736C60.3574 4.86822 61.0479 3.8097 61.9409 2.93643C62.8142 2.04653 63.8713 1.35795 65.0382 0.918729C66.1546 0.486489 67.4233 0.192495 69.287 0.104997C69.7525 0.0839979 70.1409 0.0664984 70.5329 0.0524987L70.8724 0.0419989C72.1484 0.010907 73.4248 -0.00251066 74.7012 0.00174983L78.299 0ZM76.5001 8.7498C74.1796 8.7498 71.9541 9.67165 70.3132 11.3126C68.6724 12.9535 67.7506 15.179 67.7506 17.4996C67.7506 19.8202 68.6724 22.0457 70.3132 23.6866C71.9541 25.3275 74.1796 26.2494 76.5001 26.2494C78.8206 26.2494 81.0461 25.3275 82.687 23.6866C84.3278 22.0457 85.2497 19.8202 85.2497 17.4996C85.2497 15.179 84.3278 12.9535 82.687 11.3126C81.0461 9.67165 78.8206 8.7498 76.5001 8.7498ZM76.5001 12.2497C77.1895 12.2496 77.8722 12.3853 78.5092 12.649C79.1461 12.9127 79.7249 13.2993 80.2125 13.7867C80.7001 14.2742 81.0868 14.8528 81.3508 15.4897C81.6147 16.1266 81.7506 16.8093 81.7507 17.4987C81.7508 18.1881 81.6152 18.8708 81.3514 19.5078C81.0877 20.1448 80.7011 20.7236 80.2137 21.2112C79.7263 21.6988 79.1477 22.0856 78.5108 22.3495C77.8739 22.6134 77.1913 22.7494 76.5019 22.7495C75.1095 22.7495 73.7743 22.1964 72.7897 21.2118C71.8052 20.2273 71.2521 18.8919 71.2521 17.4996C71.2521 16.1072 71.8052 14.7719 72.7897 13.7874C73.7743 12.8028 75.1095 12.2497 76.5019 12.2497M85.6889 6.12486C85.1088 6.12486 84.5524 6.35532 84.1422 6.76555C83.732 7.17577 83.5015 7.73216 83.5015 8.31231C83.5015 8.89245 83.732 9.44884 84.1422 9.85907C84.5524 10.2693 85.1088 10.4998 85.6889 10.4998C86.269 10.4998 86.8254 10.2693 87.2356 9.85907C87.6458 9.44884 87.8763 8.89245 87.8763 8.31231C87.8763 7.73216 87.6458 7.17577 87.2356 6.76555C86.8254 6.35532 86.269 6.12486 85.6889 6.12486Z" fill="#1F264C" />
//                             <path d="M32.6376 2.19726L1.63428 14.416C-0.481562 15.2846 -0.469322 16.4909 1.24609 17.0289L9.20587 19.5666L27.6225 7.69098C28.4933 7.14947 29.2889 7.44077 28.6349 8.03411L13.7138 21.797H13.7103L13.7138 21.7988L13.1648 30.1841C13.9691 30.1841 14.3241 29.807 14.7753 29.362L18.6415 25.5197L26.6835 31.5906C28.1663 32.4252 29.2312 31.9963 29.6002 30.1877L34.8793 4.76004C35.4196 2.54575 34.0522 1.54316 32.6376 2.19726Z" fill="#1F264C" />
//                         </svg>
//                     </div>
//                     <p className='conection'>ارتباط با ما</p>
//                     <div className='conections'>
//                         <div className='calling'>
//                             <p className='callInfo'>09123456789</p>
//                             <div className='info'>
//                                 <p className='infoName'>شماره تماس</p>
//                                 <svg xmlns="http://www.w3.org/2000/svg" width="57" height="57" viewBox="0 0 57 57" fill="none">
//                                     <g opacity="0.5" filter="url(#filter0_bd_123_103322)">
//                                         <path d="M19.8397 15C23.6887 8.33335 33.3113 8.33333 37.1603 15L44.5215 27.75C48.3705 34.4167 43.5592 42.75 35.8612 42.75H21.1388C13.4408 42.75 8.62953 34.4167 12.4785 27.75L19.8397 15Z" fill="#3650BF" />
//                                     </g>
//                                     <path fill-rule="evenodd" clip-rule="evenodd" d="M23.9809 11C27.4673 11 30.8073 13.9495 29.8263 17.8002C28.8369 21.663 26.8273 25.1887 24.0079 28.0083C21.1884 30.828 17.6629 32.8379 13.8002 33.8276C9.94946 34.806 7 31.4659 7 27.9809V26.6747C7 25.2026 8.17691 24.1341 9.48183 24.0048C10.5516 23.8992 11.6017 23.6465 12.6024 23.2537C12.8388 23.1608 13.0972 23.1389 13.3459 23.1907C13.5947 23.2424 13.8229 23.3655 14.0027 23.545L15.3128 24.8538C17.6352 23.5528 19.5528 21.6352 20.8538 19.3128L19.545 18.0014C19.3655 17.8216 19.2424 17.5933 19.1907 17.3446C19.1389 17.0959 19.1608 16.8375 19.2537 16.6011C19.6466 15.6 19.8993 14.5495 20.0048 13.4792C20.1341 12.1782 21.2026 11 22.6747 11H23.9809Z" fill="#1F264C" />
//                                     <defs>
//                                         <filter id="filter0_bd_123_103322" x="-1.87616" y="-3" width="60.7523" height="58.75" filterUnits="userSpaceOnUse" color-interpolation-filters="sRGB">
//                                             <feFlood flood-opacity="0" result="BackgroundImageFix" />
//                                             <feGaussianBlur in="BackgroundImageFix" stdDeviation="6.5" />
//                                             <feComposite in2="SourceAlpha" operator="in" result="effect1_backgroundBlur_123_103322" />
//                                             <feColorMatrix in="SourceAlpha" type="matrix" values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 127 0" result="hardAlpha" />
//                                             <feMorphology radius="2" operator="dilate" in="SourceAlpha" result="effect2_dropShadow_123_103322" />
//                                             <feOffset />
//                                             <feGaussianBlur stdDeviation="3.95" />
//                                             <feComposite in2="hardAlpha" operator="out" />
//                                             <feColorMatrix type="matrix" values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0.4 0" />
//                                             <feBlend mode="normal" in2="effect1_backgroundBlur_123_103322" result="effect2_dropShadow_123_103322" />
//                                             <feBlend mode="normal" in="SourceGraphic" in2="effect2_dropShadow_123_103322" result="shape" />
//                                         </filter>
//                                     </defs>
//                                 </svg>
//                             </div>
//                         </div>
//                         <div className='calling'>
//                             <p className='callInfo'>@ChoobLebasiadmin</p>
//                             <div className='info'>
//                                 <p className='infoName'>تلگرام</p>
//                                 <svg xmlns="http://www.w3.org/2000/svg" width="57" height="57" viewBox="0 0 57 57" fill="none">
//                                     <g opacity="0.5" filter="url(#filter0_bd_123_103310)">
//                                         <path d="M19.8397 15C23.6887 8.33335 33.3113 8.33333 37.1603 15L44.5215 27.75C48.3705 34.4167 43.5592 42.75 35.8612 42.75H21.1388C13.4408 42.75 8.62953 34.4167 12.4785 27.75L19.8397 15Z" fill="#3650BF" />
//                                     </g>
//                                     <path d="M28.4475 11.1315L8.07396 19.2774C6.68354 19.8564 6.69159 20.6606 7.81886 21.0192L13.0496 22.7111L25.1519 14.794C25.7242 14.433 26.247 14.6272 25.8172 15.0227L16.012 24.198H16.0097L16.012 24.1992L15.6511 29.7894C16.1797 29.7894 16.413 29.538 16.7095 29.2414L19.2501 26.6798L24.5348 30.7271C25.5093 31.2835 26.2091 30.9975 26.4515 29.7918L29.9207 12.84C30.2758 11.3638 29.3772 10.6954 28.4475 11.1315Z" fill="#1F264C" />
//                                     <defs>
//                                         <filter id="filter0_bd_123_103310" x="-1.87616" y="-3" width="60.7523" height="58.75" filterUnits="userSpaceOnUse" color-interpolation-filters="sRGB">
//                                             <feFlood flood-opacity="0" result="BackgroundImageFix" />
//                                             <feGaussianBlur in="BackgroundImageFix" stdDeviation="6.5" />
//                                             <feComposite in2="SourceAlpha" operator="in" result="effect1_backgroundBlur_123_103310" />
//                                             <feColorMatrix in="SourceAlpha" type="matrix" values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 127 0" result="hardAlpha" />
//                                             <feMorphology radius="2" operator="dilate" in="SourceAlpha" result="effect2_dropShadow_123_103310" />
//                                             <feOffset />
//                                             <feGaussianBlur stdDeviation="3.95" />
//                                             <feComposite in2="hardAlpha" operator="out" />
//                                             <feColorMatrix type="matrix" values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0.4 0" />
//                                             <feBlend mode="normal" in2="effect1_backgroundBlur_123_103310" result="effect2_dropShadow_123_103310" />
//                                             <feBlend mode="normal" in="SourceGraphic" in2="effect2_dropShadow_123_103310" result="shape" />
//                                         </filter>
//                                     </defs>
//                                 </svg>
//                             </div>
//                         </div>
//                         <div className='calling'>
//                             <p className='callInfo'>info@ChoobLebasi.ir</p>
//                             <div className='info'>
//                                 <p className='infoName'>ایمیل</p>
//                                 <svg xmlns="http://www.w3.org/2000/svg" width="57" height="57" viewBox="0 0 57 57" fill="none">
//                                     <g opacity="0.5" filter="url(#filter0_bd_123_103316)">
//                                         <path d="M19.8397 15C23.6887 8.33335 33.3113 8.33333 37.1603 15L44.5215 27.75C48.3705 34.4167 43.5592 42.75 35.8612 42.75H21.1388C13.4408 42.75 8.62953 34.4167 12.4785 27.75L19.8397 15Z" fill="#3650BF" />
//                                     </g>
//                                     <path d="M9.54203 11H27.458C29.1481 11 30 11.7978 30 13.4203V24.8054C30 26.4145 29.1481 27.2257 27.458 27.2257H9.54203C7.85185 27.2257 7 26.4145 7 24.8054V13.4203C7 11.7978 7.85185 11 9.54203 11ZM18.4932 22.6285L27.6067 15.1511C27.9312 14.8807 28.1881 14.2587 27.7825 13.7043C27.3904 13.1499 26.6737 13.1364 26.2005 13.4744L18.4932 18.6937L10.7995 13.4744C10.3263 13.1364 9.60964 13.1499 9.21752 13.7043C8.81188 14.2587 9.06878 14.8807 9.3933 15.1511L18.4932 22.6285Z" fill="#1F264C" />
//                                     <defs>
//                                         <filter id="filter0_bd_123_103316" x="-1.87616" y="-3" width="60.7523" height="58.75" filterUnits="userSpaceOnUse" color-interpolation-filters="sRGB">
//                                             <feFlood flood-opacity="0" result="BackgroundImageFix" />
//                                             <feGaussianBlur in="BackgroundImageFix" stdDeviation="6.5" />
//                                             <feComposite in2="SourceAlpha" operator="in" result="effect1_backgroundBlur_123_103316" />
//                                             <feColorMatrix in="SourceAlpha" type="matrix" values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 127 0" result="hardAlpha" />
//                                             <feMorphology radius="2" operator="dilate" in="SourceAlpha" result="effect2_dropShadow_123_103316" />
//                                             <feOffset />
//                                             <feGaussianBlur stdDeviation="3.95" />
//                                             <feComposite in2="hardAlpha" operator="out" />
//                                             <feColorMatrix type="matrix" values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0.4 0" />
//                                             <feBlend mode="normal" in2="effect1_backgroundBlur_123_103316" result="effect2_dropShadow_123_103316" />
//                                             <feBlend mode="normal" in="SourceGraphic" in2="effect2_dropShadow_123_103316" result="shape" />
//                                         </filter>
//                                     </defs>
//                                 </svg>
//                             </div>
//                         </div>
//                     </div>
//                 </div>

//             </div>
//             <div className='divCopy'>
//                 <p className='divCopy'>کلیه حقوق محصولات و محتوای این سایت متعلق به گروه لورم ایپسوم میباشد و هر گونه کپی برداری از محتوا و محصولات سایت غیر مجاز و بدون رضایت ماست</p>
//             </div>

//         </div>
//     )
// }
